# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO12 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo12
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo12n.yaml' will call yolo12.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 272 layers, 2,602,288 parameters, 2,602,272 gradients, 6.7 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 272 layers, 9,284,096 parameters, 9,284,080 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 292 layers, 20,199,168 parameters, 20,199,152 gradients, 68.1 GFLOPs
  l: [1.00, 1.00, 512] # summary: 488 layers, 26,450,784 parameters, 26,450,768 gradients, 89.7 GFLOPs
  x: [1.00, 1.50, 512] # summary: 488 layers, 59,210,784 parameters, 59,210,768 gradients, 200.3 GFLOPs

# YOLO12n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # P1/2 0
  - [-1, 1, Conv, [64, 3, 2]] # P2/4 1
  - [-1, 1, CBAM, [64]] # 2
  - [-1, 2, C3k2, [256, False, 0.25]] # 3
  - [-1, 1, Conv, [256, 3, 2]] # P3/8 4
  - [-1, 1, CBAM, [256]] # 5
  - [-1, 2, C3k2, [512, False, 0.25]] # 6
  - [-1, 1, Conv, [512, 3, 2]] # P4/16 7
  - [-1, 1, CBAM, [512]] # 8
  - [-1, 4, A2C2f, [512, True, 4]] # 9
  - [-1, 1, Conv, [1024, 3, 2]] # P5/32 10
  - [-1, 1, CBAM, [1024]] # 11
  - [-1, 4, A2C2f, [1024, True, 1]] # 12

# YOLO12n head
head:
  - [-1, 1, CBAM, [1024]] # 13
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 9], 1, Concat, [1]] # cat backbone P4 15
  - [-1, 2, A2C2f, [512, False, -1]] # 16

  - [-1, 1, CBAM, [512]] # 17
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 18
  - [[-1, 6], 1, Concat, [1]] # cat backbone P3 19
  - [-1, 2, A2C2f, [256, False, -1]] # 20

  - [-1, 1, CBAM, [256]] # 21
  - [-1, 1, Conv, [256, 3, 2]] # 22
  - [[-1, 16], 1, Concat, [1]] # cat head P4 23
  - [-1, 2, A2C2f, [512, False, -1]] # 24

  - [-1, 1, Conv, [512, 3, 2]] # 25
  - [-1, 1, CBAM, [512]] # 26
  - [[-1, 12], 1, Concat, [1]] # cat head P5 # 27
  - [-1, 2, C3k2, [1024, True]] # (P5/32-large) # 28

  - [[20, 24, 28], 1, Detect, [nc]] # Detect(P3, P4, P5)